Repository: Maksimka101/nant_chat
Catalog: lib/l10n/intl_*.arb
Languages: ru

source: Wait a second please
ru: Подождите немного

source: Failed to create user due to: {error}
ru: Не удалось создать пользователя: {error}

source: Authorization
ru: Авторизация

# looksLikeYouAreHereFirstTime
source: Looks like you are first time here. What is your name and the address of the server that application will work with?
ru: Похоже вы здесь впервые. Как вас зовут?

source: Enter your name
ru: Введите свое имя

# userNameMustHaveAtLeast4Character
source: User name must have at least 4 characters
ru: Имя должно содержать не менее 4-х символов

# nameMustHaveNoMoreThan16Character
source: Name must have no more than 16 characters
ru: Имя должно содержать не более 16-ти символов

source: Rooms
ru: Комнаты

source: Profile
ru: Профиль

source: Sign out
ru: Выйти

source: Create Room
ru: Создать комнату

# toCreateANewRoomYouNeedTo
source: To create a new room, you need to come up with its name and write the first message
ru: Для создания комнаты определитесь с ее именем и напишите первое сообщение

source: Enter your room name
ru: Название комнаты

source: Enter first message
ru: Первое сообщение

source: Please, enter room name
ru: Введите название комнаты

# roomNameMustHaveAtLeast4Character
source: Room name must have at least 4 characters
ru: Комната должна содержать не менее 4-х символов

# roomMustHaveNoMoreThan16Character
source: Room must have no more than 25 characters
ru: Комната должна содержать не более 25-ти символов

source: Enter your message
ru: Введите сообщение

source: Enable dark theme
ru: Включить темную тему

source: Current language:
ru: Текущий язык:

source: Tap to change language
ru: Нажмите для смены языка

source: English
ru: Английский

source: Russian
ru: Русский
